module.exports = {
	config: {
		name: "اوامر", // Name of command, it must be unique to identify with other commands
		version: "1.0", // Version of command
		author: "NTKhang", // Author of command
		countDown: 5, // Time to wait before executing command again (seconds)
		role: 0, // Role of user to use this command (0: normal user, 1: admin box chat, 2: owner bot)
		shortDescription: {
			vi: "đây là mô tả ngắn của lệnh",
			en: "this is short description of command"
		}, // Short description of command
		longDescription: {
			vi: "đây là mô tả dài của lệnh",
			en: "this is long description of command"
		}, // Long description of command
		category: "categoryName", // Category of command
		guide: {
			vi: "đây là hướng dẫn sử dụng của lệnh",
			en: "this is guide of command"
		} // Guide of command
	},

	langs: {
		vi: {
			hello: "xin chào",
			helloWithName: "xin chào, id facebook của bạn là %1"
		}, // Vietnamese language
		en: {
			hello: "hello world",
			helloWithName: "hello, your facebook id is %1"
		} // English language
	},

	// onStart is a function that will be executed when the command is executed
	onStart: async function ({ api, args, message, event, threadsData, usersData, dashBoardData, globalData, threadModel, userModel, dashBoardModel, globalModel, role, commandName, getLang }) {
		// YOUR CODE HERE
      if(args[0] === 'المطور'){
    if(role === 2){
      const msg = `༺༽༺༺ المطور  ༻༻༼༻
         ✦✦✦✦✦✦✦✦✦✦✦
                ✧✧✧✧✧✧✧
القائمة: تغيير قائمة الأوامر 

غير_البروفيل: تغيير صورة ملف البوت

حدث: تعديل أوامر النظام

مجموعة: حظر المجموعات و فك الحظر

رستر_الكوفنج: إعادة رستر الكوفنج

رستر: إعادة رستر البوت

ادمن: إضافة وحذف أدمن في البوت

القفل: تغيير الصلاحيات 

صيانة: تفعيل وضع الصيانة 

فشخ  : مو مهم تعرف 🫥😉

update: ما ليك دخل 
تحديث: ينصح به عندما تغير الأدمن

تجربة: كود برمجي

تجاهل_عام: ماليك دخل 😌



  
-----------------المعلومات----------------

☆☆☆☆البوت به 56 امر☆☆☆☆
☆☆☆المطور:-ملك الجحيم ☆☆☆
_____________________________

اذا ما فهمت طريقة عمل امر محدد
 ☆ اكتب شرح واسم الامر مثال☆
            ☆ شرح ترحيب ☆
☆☆☆☆☆☆☆☆☆☆☆☆☆☆


شكرا لكم لاضافة بوت زكسل لجروبك
           يسعدني ان اساعدك
 
 ༺༺༺༺༻༻༻༻

 `
    message.reply(msg);
    }else{
      message.send('انا قلت اوامر المطور فقط 😑')
    }
  }else if(args[0] === 'اضافية'){
    const msg = `༺༽༺༺ اضافة  ༻༻༼༻
         ✦✦✦✦✦✦✦✦✦✦✦
                ✧✧✧✧✧✧✧
نار: تحويل النص إلى صورة حرارية

دمج: دمج إيموجيهان 

تجميل: نص إنجليزي الى صورة

مشغول: تشغيل وضع عدم الإزعاج 

ويكي: البحث في ويكيبيديا 
اكتب ويكي وكلام

ارسل: يرسل اغاني وفديوهات
من اليوتيوب اكتب شرح ارسل

تيكتوك:  تنزيل الفديوهات دون 
علامة مائية 

ترجم: ترجم نص

معرف: رؤية الا id الخاص بك

مسح: حذف رسائل البوت

فايسبوك:  تحميل الفديوهات
من  الفايسبوك  

الطقس: معرفة الطقس

شرح: يشرح طريقة عمل الامر

الاوامر:  عرض قائمت الاوامر

ابلاغ:  بلغ المطور لو في 
خطأ في البوت


-----------------المعلومات----------------

☆☆☆☆البوت به 56 امر☆☆☆☆
☆☆☆المطور:-ملك الجحيم ☆☆☆
_____________________________

اذا ما فهمت طريقة عمل امر محدد
 ☆ اكتب شرح واسم الامر مثال☆
            ☆ شرح ترحيب ☆
☆☆☆☆☆☆☆☆☆☆☆☆☆☆


شكرا لكم لاضافة بوت زكسل لجروبك
           يسعدني ان اساعدك
 
 ༺༺༺༺༻༻༻༻

` 
    message.reply(msg);
  }else if(args[0] === 'الالعاب'){
    const msg = `༺༽༺༺  الالعاب  ༻༻༼༻
         ✦✦✦✦✦✦✦✦✦✦✦
                ✧✧✧✧✧✧✧
سمسمي:الدردشة بذكاء الاصطناعي 

قبلة: اكتب قبلة وتاغ لحببتك 😂

صفع: صفع وتاغ 
   
زواج: وتاغ لزوجتك يا مشاكس

هز: يرسل صورة حسابك وهيا 
تهتز او سوي سوي تاغ لشخص 

اكس_او: العب اكس وشخص

انمي: يرسل صور انمي عشوائي
 
اتهام: اتهام وميمز واضحك

إنمي: يرسل صور انمي متحركة

ضرب: ضرب للذكور فقط
  ممنوع للبنات لا تجربو

ايموجي:  تحت الانشاء


تنبيه:- 
سيت اضافة العديد من الالعاب
 في القريب العاجل


-----------------المعلومات----------------

☆☆☆☆البوت به 56 امر☆☆☆☆
☆☆☆المطور:-ملك الجحيم ☆☆☆
_____________________________

اذا ما فهمت طريقة عمل امر محدد
 ☆ اكتب شرح واسم الامر مثال☆
            ☆ شرح ترحيب ☆
☆☆☆☆☆☆☆☆☆☆☆☆☆☆


شكرا لكم لاضافة بوت زكسل لجروبك
           يسعدني ان اساعدك
 
 ༺༺༺༺༻༻༻༻

`
    message.reply(msg);
  }else if(args[0] === 'الادمن'){
    const msg = `༺༽༺༺ الادمن  ༻༻༼༻
         ✦✦✦✦✦✦✦✦✦✦✦
                ✧✧✧✧✧✧✧
بوت:  ايقاف وتشغيل البوت 
في جروبك 

تصفية: يتخلص من الحسابات 
المحظورة في جروبك 


توديع:  تعديل نص عند خروج
شخص من جروبك 

ترحيب:  يغير نص عند دخول 
شخص لجروبك 

كنية: تعديل كنية الناس
 كل الجروب 

منشن: تاغ للكل

حظر: حظر والغاء حظر الاعضاء 


تحذير: تحذير أعضاء

رد:  اضافة ردود يقولها البوت 
عندما تقول اسمك

طرد: طرد عضو


-----------------المعلومات----------------

☆☆☆☆البوت به 56 امر☆☆☆☆
☆☆☆المطور:-ملك الجحيم ☆☆☆
_____________________________

اذا ما فهمت طريقة عمل امر محدد
 ☆ اكتب شرح واسم الامر مثال☆
            ☆ شرح ترحيب ☆
☆☆☆☆☆☆☆☆☆☆☆☆☆☆


شكرا لكم لاضافة بوت زكسل لجروبك
           يسعدني ان اساعدك
 
 ༺༺༺༺༻༻༻༻

 `
    message.reply(msg);
  }else{return}
		

 }
};